AlmAck/svdtonuttx/demo/h/da1470x_oqspif.h
/* OQSPIF_BURSTCMDB Register */

#define OQSPIF_OSPIC_CS_HIGH_MIN_MASK               (0x7 << 16) /* Between the transmissions of two different instructions to the flash memory, the */
#define OQSPIF_OSPIC_CS_HIGH_MIN_POS                (16) /* Between the transmissions of two different instructions to the flash memory, the */
#define OQSPIF_OSPIC_WRAP_SIZE_MASK                 (0x3 << 14) /* It describes the selected data size of a wrapping burst (OSPIC_WRAP_MD). 0x0: by */
#define OQSPIF_OSPIC_WRAP_SIZE_POS                  (14) /* It describes the selected data size of a wrapping burst (OSPIC_WRAP_MD). 0x0: by */
#define OQSPIF_OSPIC_WRAP_LEN_MASK                  (0x3 << 12) /* It describes the selected length of a wrapping burst (OSPIC_WRAP_MD). 0x0: 4 bea */
#define OQSPIF_OSPIC_WRAP_LEN_POS                   (12) /* It describes the selected length of a wrapping burst (OSPIC_WRAP_MD). 0x0: 4 bea */
#define OQSPIF_OSPIC_WRAP_MD                        (1U << 11) /* Wrap mode 0: The OSPIC_INST is the selected instruction at any access. 1: The OS */
#define OQSPIF_OSPIC_INST_MD                        (1U << 10) /* Instruction mode 0: Transmit instruction at any burst access. 1: Transmit instru */
#define OQSPIF_OSPIC_DMY_EN                         (1U << 9) /* Dummy bytes enable 0: Don't send the dummy bytes 1: Send the dummy bytes. The nu */
#define OQSPIF_OSPIC_DMY_NUM_MASK                   (0x1F << 4) /* Number of dummy bytes (minus 1). Can be set 1 up to 32 dummy bytes (values 0 up  */
#define OQSPIF_OSPIC_DMY_NUM_POS                    (4) /* Number of dummy bytes (minus 1). Can be set 1 up to 32 dummy bytes (values 0 up  */
#define OQSPIF_OSPIC_EXT_HF_DS                      (1U << 3) /* Extra half disable output 0: if OSPIC_EXT_BYTE_EN=1, is transmitted the complete */
#define OQSPIF_OSPIC_EXT_BYTE_EN                    (1U << 2) /* Extra byte enable 0: Don't send the OSPIC_EXT_BYTE 1: Send the OSPIC_EXT_BYTE */
#define OQSPIF_OSPIC_DAT_RX_MD_MASK                 (0x3 << 0) /* It describes the mode of the SPI bus during the data phase. 0x0: Single SPI 0x1: */
#define OQSPIF_OSPIC_DAT_RX_MD_POS                  (0) /* It describes the mode of the SPI bus during the data phase. 0x0: Single SPI 0x1: */

/* OQSPIF_CHCKERASE Register */

#define OQSPIF_OSPIC_CHCKERASE_MASK                 (0xFFFFFFFF << 0) /* Writing any value to this register during erasing, forces the controller to read */
#define OQSPIF_OSPIC_CHCKERASE_POS                  (0) /* Writing any value to this register during erasing, forces the controller to read */

/* OQSPIF_CTRLBUS Register */

#define OQSPIF_OSPIC_DIS_CS                         (1U << 5) /* Write 1 to disable the chip select (active low) when the controller is in Manual */
#define OQSPIF_OSPIC_EN_CS                          (1U << 4) /* Write 1 to enable the chip select (active low) when the controller is in Manual  */
#define OQSPIF_OSPIC_SET_OCTAL                      (1U << 3) /* Write 1 to set the bus mode in Octal mode when the controller is in Manual mode. */
#define OQSPIF_OSPIC_SET_QUAD                       (1U << 2) /* Write 1 to set the bus mode in Quad mode when the controller is in Manual mode. */
#define OQSPIF_OSPIC_SET_DUAL                       (1U << 1) /* Write 1 to set the bus mode in Dual mode when the controller is in Manual mode. */
#define OQSPIF_OSPIC_SET_SINGLE                     (1U << 0) /* Write 1 to set the bus mode in Single SPI mode when the controller is in Manual  */

/* OQSPIF_CTRLMODE Register */

#define OQSPIF_OSPIC_IO_UH_DAT_MASK                 (0xF << 28) /* The value of OSPI_IO4-7 pads if OSPI_IO_UH_OEN is 1 */
#define OQSPIF_OSPIC_IO_UH_DAT_POS                  (28) /* The value of OSPI_IO4-7 pads if OSPI_IO_UH_OEN is 1 */
#define OQSPIF_OSPIC_IO_UH_OEN                      (1U << 27) /* Forces the output enable for the upper half of the OSPI bus (OSPI_IO4-7). Set th */
#define OQSPIF_OSPIC_INC_LIM_EN                     (1U << 18) /* This bit has meaning only for the read in auto mode and only when the read acces */
#define OQSPIF_OSPIC_RD_ERR_EN                      (1U << 17) /* Controls the generation of AHB bus error response when a read is performed in th */
#define OQSPIF_OSPIC_MAN_DIRCHG_MD                  (1U << 16) /* Selection of the direction change method in manual mode. 0 : the bus direction g */
#define OQSPIF_OSPIC_DMY_MD                         (1U << 15) /* Defines the clock cycle where the bus will turn in Hi-z during the transmission  */
#define OQSPIF_OSPIC_CMD_X2_EN                      (1U << 14) /* Defines the number of bytes that consist the instruction code in the command seq */
#define OQSPIF_OSPIC_USE_32BA                       (1U << 13) /* Controls the length of the address that the external memory device uses. 0: The  */
#define OQSPIF_OSPIC_BUF_LIM_EN                     (1U << 12) /* This bit has meaning only for the read in auto mode. Defines the behavior of the */
#define OQSPIF_OSPIC_PCLK_MD_MASK                   (0x7 << 9) /* Read pipe clock delay relative to the falling edge of OSPI_SCK. Refer to OSPI Ti */
#define OQSPIF_OSPIC_PCLK_MD_POS                    (9) /* Read pipe clock delay relative to the falling edge of OSPI_SCK. Refer to OSPI Ti */
#define OQSPIF_OSPIC_RPIPE_EN                       (1U << 8) /* Controls the use of the data read pipe. 0: The read pipe is disabled; the sampli */
#define OQSPIF_OSPIC_RXD_NEG                        (1U << 7) /* Defines the clock edge that is used for the capturing of the received data, when */
#define OQSPIF_OSPIC_HRDY_MD                        (1U << 6) /* This configuration bit is useful when the frequency of the OSPI clock is much lo */
#define OQSPIF_OSPIC_IO3_DAT                        (1U << 5) /* The value of OSPI_IO3 pad if OSPI_IO3_OEN is 1 */
#define OQSPIF_OSPIC_IO2_DAT                        (1U << 4) /* The value of OSPI_IO2 pad if OSPI_IO2_OEN is 1 */
#define OQSPIF_OSPIC_IO3_OEN                        (1U << 3) /* Forces the output enable of the OSPI_IO3. Set this bit to 1 only in SPI or Dual  */
#define OQSPIF_OSPIC_IO2_OEN                        (1U << 2) /* Forces the output enable of the OSPI_IO2. Set this bit to 1 only in SPI or Dual  */
#define OQSPIF_OSPIC_CLK_MD                         (1U << 1) /* Mode of the generated OSPI_SCK clock 0: Use Mode 0 for the OSPI_CLK. The OSPI_SC */
#define OQSPIF_OSPIC_AUTO_MD                        (1U << 0) /* Mode of operation 0: The Manual Mode is selected. 1: The Auto Mode is selected.  */

/* OQSPIF_CTR_CTRL Register */

