AlmAck/svdtonuttx/demo/h/da1470x_oqspif.h
#define OQSPIF_OSPIC_CTR_EN                         (1U << 0) /* Controls the AES-CTR decryption feature of the OSPIC, which enables the decrypti */

/* OQSPIF_CTR_EADDR Register */

#define OQSPIF_OSPIC_CTR_EADDR_MASK                 (0x3FFFFF << 10) /* Defines the bits [31:10] of the end address in the flash memory, where an encryp */
#define OQSPIF_OSPIC_CTR_EADDR_POS                  (10) /* Defines the bits [31:10] of the end address in the flash memory, where an encryp */

/* OQSPIF_CTR_KEY_0_3 Register */

#define OQSPIF_OSPIC_CTR_KEY_0_3_MASK               (0xFFFFFFFF << 0) /* Defines the key that is used by the AES-CTR algorithm, when the on-the-fly decry */
#define OQSPIF_OSPIC_CTR_KEY_0_3_POS                (0) /* Defines the key that is used by the AES-CTR algorithm, when the on-the-fly decry */

/* OQSPIF_CTR_KEY_12_15 Register */

#define OQSPIF_OSPIC_CTR_KEY_12_15_MASK             (0xFFFFFFFF << 0) /* See the description in the OSPIC_CTR_KEY_0_3. */
#define OQSPIF_OSPIC_CTR_KEY_12_15_POS              (0) /* See the description in the OSPIC_CTR_KEY_0_3. */

/* OQSPIF_CTR_KEY_16_19 Register */

#define OQSPIF_OSPIC_CTR_KEY_16_19_MASK             (0xFFFFFFFF << 0) /* See the description in the OSPIC_CTR_KEY_0_3. */
#define OQSPIF_OSPIC_CTR_KEY_16_19_POS              (0) /* See the description in the OSPIC_CTR_KEY_0_3. */

/* OQSPIF_CTR_KEY_20_23 Register */

#define OQSPIF_OSPIC_CTR_KEY_20_23_MASK             (0xFFFFFFFF << 0) /* See the description in the OSPIC_CTR_KEY_0_3. */
#define OQSPIF_OSPIC_CTR_KEY_20_23_POS              (0) /* See the description in the OSPIC_CTR_KEY_0_3. */

/* OQSPIF_CTR_KEY_24_27 Register */

#define OQSPIF_OSPIC_CTR_KEY_24_27_MASK             (0xFFFFFFFF << 0) /* See the description in the OSPIC_CTR_KEY_0_3. */
#define OQSPIF_OSPIC_CTR_KEY_24_27_POS              (0) /* See the description in the OSPIC_CTR_KEY_0_3. */

/* OQSPIF_CTR_KEY_28_31 Register */

#define OQSPIF_OSPIC_CTR_KEY_28_31_MASK             (0xFFFFFFFF << 0) /* See the description in the OSPIC_CTR_KEY_0_3. */
#define OQSPIF_OSPIC_CTR_KEY_28_31_POS              (0) /* See the description in the OSPIC_CTR_KEY_0_3. */

/* OQSPIF_CTR_KEY_4_7 Register */

#define OQSPIF_OSPIC_CTR_KEY_4_7_MASK               (0xFFFFFFFF << 0) /* See the description in the OSPIC_CTR_KEY_0_3. */
#define OQSPIF_OSPIC_CTR_KEY_4_7_POS                (0) /* See the description in the OSPIC_CTR_KEY_0_3. */

/* OQSPIF_CTR_KEY_8_11 Register */

#define OQSPIF_OSPIC_CTR_KEY_8_11_MASK              (0xFFFFFFFF << 0) /* See the description in the OSPIC_CTR_KEY_0_3. */
#define OQSPIF_OSPIC_CTR_KEY_8_11_POS               (0) /* See the description in the OSPIC_CTR_KEY_0_3. */

/* OQSPIF_CTR_NONCE_0_3 Register */

#define OQSPIF_OSPIC_CTR_NONCE_0_3_MASK             (0xFFFFFFFF << 0) /* Defines the 8 bytes of the nonce value (N0 - N7) that is used by the AES-CTR alg */
#define OQSPIF_OSPIC_CTR_NONCE_0_3_POS              (0) /* Defines the 8 bytes of the nonce value (N0 - N7) that is used by the AES-CTR alg */

/* OQSPIF_CTR_NONCE_4_7 Register */

#define OQSPIF_OSPIC_CTR_NONCE_4_7_MASK             (0xFFFFFFFF << 0) /* See the description in the OSPIC_NONCE_0_3. */
#define OQSPIF_OSPIC_CTR_NONCE_4_7_POS              (0) /* See the description in the OSPIC_NONCE_0_3. */

/* OQSPIF_CTR_SADDR Register */

#define OQSPIF_OSPIC_CTR_SADDR_MASK                 (0x3FFFFF << 10) /* Defines the bits [31:10] of the start address in the flash memory, where an encr */
#define OQSPIF_OSPIC_CTR_SADDR_POS                  (10) /* Defines the bits [31:10] of the start address in the flash memory, where an encr */

/* OQSPIF_DUMMYDATA Register */

#define OQSPIF_OSPIC_DUMMYDATA_MASK                 (0xFFFFFFFF << 0) /* Writing to this register generates a number of clock pulses to the SPI bus. Duri */
#define OQSPIF_OSPIC_DUMMYDATA_POS                  (0) /* Writing to this register generates a number of clock pulses to the SPI bus. Duri */

/* OQSPIF_ERASECMDA Register */

#define OQSPIF_OSPIC_RES_INST_MASK                  (0xFF << 24) /* The code value of the erase resume instruction */
#define OQSPIF_OSPIC_RES_INST_POS                   (24) /* The code value of the erase resume instruction */
#define OQSPIF_OSPIC_SUS_INST_MASK                  (0xFF << 16) /* The code value of the erase suspend instruction. */
#define OQSPIF_OSPIC_SUS_INST_POS                   (16) /* The code value of the erase suspend instruction. */
#define OQSPIF_OSPIC_WEN_INST_MASK                  (0xFF << 8) /* The code value of the write enable instruction. */
#define OQSPIF_OSPIC_WEN_INST_POS                   (8) /* The code value of the write enable instruction. */
#define OQSPIF_OSPIC_ERS_INST_MASK                  (0xFF << 0) /* The code value of the erase instruction. */
#define OQSPIF_OSPIC_ERS_INST_POS                   (0) /* The code value of the erase instruction. */

/* OQSPIF_ERASECMDB Register */

#define OQSPIF_OSPIC_RESSUS_DLY_MASK                (0xFF << 24) /* Defines a timer that counts the minimum allowed delay between an erase suspend c */
#define OQSPIF_OSPIC_RESSUS_DLY_POS                 (24) /* Defines a timer that counts the minimum allowed delay between an erase suspend c */
#define OQSPIF_OSPIC_ERSRES_HLD_MASK                (0xF << 16) /* The controller must stay without flash memory reading requests for this number o */
#define OQSPIF_OSPIC_ERSRES_HLD_POS                 (16) /* The controller must stay without flash memory reading requests for this number o */
#define OQSPIF_OSPIC_ERS_CS_HI_MASK                 (0x1F << 10) /* After the execution of instructions: write enable, erase, erase suspend and eras */
#define OQSPIF_OSPIC_ERS_CS_HI_POS                  (10) /* After the execution of instructions: write enable, erase, erase suspend and eras */
#define OQSPIF_OSPIC_EAD_TX_MD_MASK                 (0x3 << 8) /* The mode of the OSPI Bus during the address phase of the erase instruction 0x0:  */
#define OQSPIF_OSPIC_EAD_TX_MD_POS                  (8) /* The mode of the OSPI Bus during the address phase of the erase instruction 0x0:  */
#define OQSPIF_OSPIC_RES_TX_MD_MASK                 (0x3 << 6) /* The mode of the OSPI Bus during the transmission of the resume instruction 0x0:  */
#define OQSPIF_OSPIC_RES_TX_MD_POS                  (6) /* The mode of the OSPI Bus during the transmission of the resume instruction 0x0:  */
#define OQSPIF_OSPIC_SUS_TX_MD_MASK                 (0x3 << 4) /* The mode of the OSPI Bus during the transmission of the suspend instruction. 0x0 */
#define OQSPIF_OSPIC_SUS_TX_MD_POS                  (4) /* The mode of the OSPI Bus during the transmission of the suspend instruction. 0x0 */
#define OQSPIF_OSPIC_WEN_TX_MD_MASK                 (0x3 << 2) /* The mode of the OSPI Bus during the transmission of the write enable instruction */
#define OQSPIF_OSPIC_WEN_TX_MD_POS                  (2) /* The mode of the OSPI Bus during the transmission of the write enable instruction */
#define OQSPIF_OSPIC_ERS_TX_MD_MASK                 (0x3 << 0) /* The mode of the OSPI Bus during the instruction phase of the erase instruction 0 */
#define OQSPIF_OSPIC_ERS_TX_MD_POS                  (0) /* The mode of the OSPI Bus during the instruction phase of the erase instruction 0 */

/* OQSPIF_ERASECMDC Register */

